<a href="https://colab.research.google.com/github/sumanthgm/Data-Structures-Python/blob/main/TakeHome_practice(Session_4).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<table align="left" width=100%>
    <tr>
        <td width="10%">
            <img src="homework.png">
        </td>
        <td>
            <div align="center">
                <font color="#21618C" size=8px>
                  <b> TakeHome <br> (Session 4) </b>
                </font>
            </div>
        </td>
    </tr>
</table>

### Let's begin with some hands-on practice exercises

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 1. Create a dictionary named 'europe_dict' which has names of countries in europe, their capital and their population.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [ ]:
import pandas as pd

europe_dict = {
       "Country":["Spain","France","Germany","Norway"],
       "Capital":["Madrid","Paris","Berlin","Oslo"],
       "Population":[46.77,66.03,80.62,5.084]
}

europe_df = pd.DataFrame(europe_dict)

print(europe_df)

   Country Capital  Population
0    Spain  Madrid      46.770
1   France   Paris      66.030
2  Germany  Berlin      80.620
3   Norway    Oslo       5.084

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 2. Use the data from question 1 and add a new column 'FamousFor'. The column should indicate what each country is famous for.
                    </b>
                </font>
            </div>    
        </td>
    </tr>
</table>

In [ ]:
# add a new column
europe_df['FamousFor'] = ['Football','Eiffel Tower','Cars','Midnight sun']
print(europe_df)

   Country Capital  Population     FamousFor
0    Spain  Madrid      46.770      Football
1   France   Paris      66.030  Eiffel Tower
2  Germany  Berlin      80.620          Cars
3   Norway    Oslo       5.084  Midnight sun

**Note:** Assigning a column that doesnâ€™t exist will create a new column.

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 3. Use the data created in question 1, to do the following:
                          <ol type = '1'>
                              <li>  Access column 'Captial' by specifying the column number. </li>
                              <li>  Access column 'Population' by specifying the column name.
                              <li>  Access a country information </li>
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [ ]:
# 1. Access column 'Captial' by specifying the column number.

europe_df.iloc[:,1]

0    Madrid
1     Paris
2    Berlin
3      Oslo
Name: Capital, dtype: object

In [ ]:
# 2. Access column 'Population' by specifying the column name.
europe_df.Population

# OR
europe_df["Population"]

# Use any one command

0    46.770
1    66.030
2    80.620
3     5.084
Name: Population, dtype: float64

In [ ]:
# 3. Access a country information
# Let's say we want access information for France

europe_df.loc[1]

Country             France
Capital              Paris
Population           66.03
FamousFor     Eiffel Tower
Name: 1, dtype: object

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 4. Read a csv file "example.csv", print it and also check its dimensions
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [ ]:
example = pd.read_csv("example.csv")

print(example)

NameError: name 'pd' is not defined

In [ ]:
# check dimension/shape of the dataframe
dimension = example.shape

print(" The dataframe 'example' has %d columns and %d rows." %(dimension[1], dimension[1]))

 The dataframe 'example' has 3 columns and 3 rows.

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 5. Create a new column BMI, calculate the BMI of persons based on their weight and height.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [ ]:
profit = []
for i in range(dimension[0]):
    cp = example["Cost Price"].iloc[i]
    sp = example["Selling Price"].iloc[i]
    profit.append(sp - cp)

# OR use the following to calculate profits
# Profits = example["Selling Price"] - example["Cost Price"]

example.insert(loc = 3 , column = 'Profit',value = profit)

print(example)

  Product ID  Cost Price  Selling Price  Profit
0       45SD          60            135      75
1       12PO          43            121      78
2       54PL          78            150      72
3       26PL          65            121      56
4       68HG          50            132      82
5       21ER         150            152       2
6       10FG         132            165      33
7       57HB         134            161      27
8       75VB         109            124      15
9      32HJH         121            152      31

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 6. Create a pandas series having values 4, 7, -5, 3, NAN and their index as d, b, a, c, e
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [ ]:
import numpy as np

series = pd.Series([4, 7, -5, 3, np.nan], index=['d', 'b', 'a', 'c',"e"])

print(series)

d    4.0
b    7.0
a   -5.0
c    3.0
e    NaN
dtype: float64

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 7. Using the series in question 6, find:
                        <ol type = '1'>
                            <li> Find the minimum of all values </li>
                            <li> Find the maximum of all value </li>
                        </ol>
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [ ]:
# the minimum of all values
series.min()

-5.0

In [ ]:
# the maximum of all value
series.max()

7.0

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 8. Using the series in question 6, sort:
                         <ol type = '1'>
                             <li>  the values in ascending order </li>
                             <li>  the values in decending order  </li>
                        </ol>
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [ ]:
# sorting the values in ascending order
series.sort_index(ascending=True)

# the value for ascending is 'True' by default

a   -5.0
b    7.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [ ]:
# sorting the values in decending order
series.sort_index(ascending=False)

e    NaN
d    4.0
c    3.0
b    7.0
a   -5.0
dtype: float64

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 9. Import dataset 'flights' from library seaborn. Print the first 10 rows and last 20 rows of the data set.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [ ]:
# import required libraries
import seaborn as sns

# load the flights data set as flight
flight = sns.load_dataset('flights')

In [ ]:
flight.head(10)

   year      month  passengers
0  1949    January         112
1  1949   February         118
2  1949      March         132
3  1949      April         129
4  1949        May         121
5  1949       June         135
6  1949       July         148
7  1949     August         148
8  1949  September         136
9  1949    October         119

In [ ]:
flight.tail(20)

     year      month  passengers
124  1959        May         420
125  1959       June         472
126  1959       July         548
127  1959     August         559
128  1959  September         463
129  1959    October         407
130  1959   November         362
131  1959   December         405
132  1960    January         417
133  1960   February         391
134  1960      March         419
135  1960      April         461
136  1960        May         472
137  1960       June         535
138  1960       July         622
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 10. Import dataset 'iris' from library seaborn. Check for datatypes of all variable.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [ ]:
# import required libraries
import seaborn as sns

# load the iris data set as iris
iris = sns.load_dataset('iris')

In [ ]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object